_posts/database/2016-11-15-mysql-configure-optimization.html
---
layout: post
title: MySQL 配置与优化
author: zrg
comments: false
description: MySQL 配置/优化
categories:
- database
tags:
- MySQL
photos:
---

<div id="outline-container-org972b0a7" class="outline-2">
<h2 id="org972b0a7">前言</h2>
<div class="outline-text-2" id="text-org972b0a7">
<pre class="example">
MySQL配置与优化

</pre>
</div>
</div>
<div id="outline-container-org1ff4e44" class="outline-2">
<h2 id="org1ff4e44">命令</h2>
<div class="outline-text-2" id="text-org1ff4e44">
</div>
<div id="outline-container-org90dd038" class="outline-3">
<h3 id="org90dd038">show</h3>
<div class="outline-text-3" id="text-org90dd038">
<div class="org-src-container">
<pre class="src src-sh">--&#26174;&#31034;&#25968;&#25454;&#24211;&#21015;&#34920;
&gt;show databases;
--&#26174;&#31034;&#34920;&#30340;&#21015;&#34920;
&gt;show tables;
&gt;show columns from table_name;
--&#29992;&#20197;&#26174;&#31034;&#26381;&#21153;&#22120;&#29366;&#24577;&#20449;&#24687;
&gt;show status;
&gt;SHOW STATUS LIKE <span style="color: #8b2252;">'%&#21464;&#37327;&#21517;% '</span>;
--&#26174;&#31034;&#21019;&#24314;&#29305;&#23450;&#25968;&#25454;&#24211;&#25110;&#34920;&#30340;MySQL&#35821;&#21477;
&gt;show create database;
&gt;show create table;
--&#26174;&#31034;&#25480;&#20104;&#29992;&#25143;&#65288;&#25152;&#26377;&#29992;&#25143;&#25110;&#29305;&#23450;&#29992;&#25143;&#65289;&#30340;&#23433;&#20840;&#26435;&#38480;
&gt;show grants;
--&#26174;&#31034;&#38169;&#35823;&#25110;&#35686;&#21578;&#20449;&#24687;
&gt;show errors;
&gt;show warnings;
--&#26174;&#31034;&#31995;&#32479;&#21464;&#37327;
&gt;SHOW VARIABLES;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org8ae609d" class="outline-2">
<h2 id="org8ae609d">配置参数</h2>
<div class="outline-text-2" id="text-org8ae609d">
</div>
<div id="outline-container-org0de456f" class="outline-3">
<h3 id="org0de456f">连接请求的变量</h3>
<div class="outline-text-3" id="text-org0de456f">
</div>
<div id="outline-container-orgd1b60e2" class="outline-4">
<h4 id="orgd1b60e2">max_connections</h4>
<div class="outline-text-4" id="text-orgd1b60e2">
<pre class="example">
MySQL的最大连接数。
数值过小会经常出现ERROR 1040: Too many connections错误，可以过’conn%’通配符查看当前状态的连接数量，以定夺该值的大小。
show variables like ‘max_connections’ 最大连接数
show status like ‘max_used_connections’响应的连接数
max_used_connections / max_connections * 100% （理想值≈ 85%），如果max_used_connections跟max_connections相同 那么就是max_connections设置过低或者超过服务器负载上限了，低于10%则设置过大。

</pre>
</div>
</div>
<div id="outline-container-orgfe2fd92" class="outline-4">
<h4 id="orgfe2fd92">back_log</h4>
<div class="outline-text-4" id="text-orgfe2fd92">
<pre class="example">
 MySQL能暂存的连接数量。用以当主要的MySQL线程在一个很短时间内得到非常多的连接请求时。
如果MySQL的连接数据达到max_connections时，新来的请求将会被存在堆栈中，以等待某一连接释放资源，该堆栈的数量即back_log，如果等待连接的数量超过back_log，将不被授予连接资源。
注1：当观察你主机进程列表（mysql&gt; show full processlist），发现大量264084 | unauthenticated user | xxx.xxx.xxx.xxx | NULL | Connect | NULL | login | NULL 的待连接进程时，就要加大back_log 的值了。
注2：默认数值是50，可调优为128，对于Linux系统设置范围为小于512的整数。

</pre>
</div>
</div>
<div id="outline-container-org6e826c6" class="outline-4">
<h4 id="org6e826c6">interactive_timeout</h4>
<div class="outline-text-4" id="text-org6e826c6">
<pre class="example">
一个交互连接在被服务器在关闭前等待行动的秒数。
默认数值是28800，可调优为7200。

</pre>
</div>
</div>
</div>
<div id="outline-container-org203d6b5" class="outline-3">
<h3 id="org203d6b5">缓冲区变量</h3>
<div class="outline-text-3" id="text-org203d6b5">
</div>
<div id="outline-container-orgcf1fad4" class="outline-4">
<h4 id="orgcf1fad4">key_buffer_size</h4>
<div class="outline-text-4" id="text-orgcf1fad4">
<pre class="example">
索引缓冲区的大小，它决定索引处理的速度，尤其是索引读的速度。
通过检查状态值Key_read_requests和Key_reads，可以知道key_buffer_size设置是否合理。比例key_reads / key_read_requests应该尽可能的低，至少是1:100，1:1000更好（上述状态值可以使用SHOW STATUS LIKE ‘key_read%’获得）。
key_buffer_size只对MyISAM表起作用。即使你不使用MyISAM表，但是内部的临时磁盘表是MyISAM表，也要使用该值。可以使用检查状态值created_tmp_disk_tables得知详情。

</pre>
</div>
</div>
<div id="outline-container-org6c42c72" class="outline-4">
<h4 id="org6c42c72">query_cache_size</h4>
<div class="outline-text-4" id="text-org6c42c72">
<pre class="example">
查询缓冲大小，MySQL将查询结果存放在缓冲区中，今后对于同样的SELECT语句（区分大小写），将直接从缓冲区中读取结果。
通过检查状态值Qcache_*，可以知道query_cache_size设置是否合理（上述状态值可以使用SHOW STATUS LIKE ‘Qcache%’获得）。如果Qcache_lowmem_prunes的值非常大，则表明经常出现缓冲不够的情况，如果Qcache_hits的值也非常大，则表明查询缓冲使用非常频繁，此时需要增加缓冲大小；如果Qcache_hits的值不大，则表明你的查询重复率很低，这种情况下使用查询缓冲反而会影响效率，那么可以考虑不用查询缓冲。此外，在SELECT语句中加入SQL_NO_CACHE可以明确表示不使用查询缓冲。
与查询缓冲有关的参数还有：

</pre>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">query_cache_type</th>
<th scope="col" class="org-left">指定是否使用查询缓冲，可以设置为0、1、2，该变量是SESSION级的变量。</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">query_cache_limit</td>
<td class="org-left">指定单个查询能够使用的缓冲区大小，缺省为1M。</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">query_cache_min_res_unit</td>
<td class="org-left">是在4.1版本以后引入的，它指定分配缓冲区空间的最小单位，缺省为4K。检查状态值Qcache_free_blocks，如果该值非常大，则表明缓冲区中碎片很多，这就表明查询结果都比较小，此时需要减小query_cache_min_res_unit。</td>
</tr>
</tbody>
</table>
<pre class="example">
mysql&gt; show global status like ‘qcache%‘;
mysql&gt; show variables like ‘query_cache%‘;
查询缓存碎片率= Qcache_free_blocks / Qcache_total_blocks * 100% 。如果查询缓存碎片率超过20%，可以用FLUSH QUERY CACHE整理缓存碎片，或者试试减小query_cache_min_res_unit，如果你的查询都是小数据量的话。
查询缓存利用率= (query_cache_size – Qcache_free_memory) / query_cache_size * 100%。查询缓存利用率在25%以下的话说明query_cache_size设置的过大，可适当减小；查询缓存利用率在80％以上而且Qcache_lowmem_prunes &gt; 50的话说明query_cache_size可能有点小，要不就是碎片太多。
查询缓存命中率= (Qcache_hits – Qcache_inserts) / Qcache_hits * 100%。
关于query_cache_type=OPTION：
Set the query cache type. Possible options are as follows:
0 : Don't cache results in or retrieve results from the query cache.
1 : Cache all query results except for those that begin with SELECT S_NO_CACHE.
2 : Cache results only for queries that begin with SELECT SQL_CACHE

</pre>
</div>
</div>
<div id="outline-container-org1334204" class="outline-4">
<h4 id="org1334204">record_buffer_size</h4>
<div class="outline-text-4" id="text-org1334204">
<pre class="example">
每个进行一个顺序扫描的线程为其扫描的每张表分配这个大小的一个缓冲区。如果你做很多顺序扫描，你可能想要增加该值。
默认数值是131072(128K)，可改为16773120 (16M)

</pre>
</div>
</div>
<div id="outline-container-org7638f4e" class="outline-4">
<h4 id="org7638f4e">read_rnd_buffer_size</h4>
<div class="outline-text-4" id="text-org7638f4e">
<pre class="example">
随机读缓冲区大小。当按任意顺序读取行时(例如，按照排序顺序)，将分配一个随机读缓存区。进行排序查询时，MySQL会首先扫描一遍该缓冲，以避免磁盘搜索，提高查询速度，如果需要排序大量数据，可适当调高该值。但MySQL会为每个客户连接发放该缓冲空间，所以应尽量适当设置该值，以避免内存开销过大。
一般可设置为16M 

</pre>
</div>
</div>
<div id="outline-container-orgb78f481" class="outline-4">
<h4 id="orgb78f481">sort_buffer_size</h4>
<div class="outline-text-4" id="text-orgb78f481">
<pre class="example">
联合查询操作所能使用的缓冲区大小
record_buffer_size，read_rnd_buffer_size，sort_buffer_size，join_buffer_size为每个线程独占，也就是说，如果有100个线程连接，则占用为16M*100

</pre>
</div>
</div>
<div id="outline-container-org871f109" class="outline-4">
<h4 id="org871f109">join_buffer_size</h4>
<div class="outline-text-4" id="text-org871f109">
<pre class="example">
联合查询操作所能使用的缓冲区大小。
record_buffer_size，read_rnd_buffer_size，sort_buffer_size，join_buffer_size为每个线程独占，也就是说，如果有100个线程连接，则占用为16M*100

</pre>
</div>
</div>
<div id="outline-container-orgf83e634" class="outline-4">
<h4 id="orgf83e634">table_cache</h4>
<div class="outline-text-4" id="text-orgf83e634">
<pre class="example">
表高速缓存的大小。
通过检查峰值时间的状态值Open_tables和Opened_tables，可以决定是否需要增加table_cache的值。如果你发现open_tables等于table_cache，并且opened_tables在不断增长，那么你就需要增加table_cache的值了（上述状态值可以使用SHOW STATUS LIKE ‘Open%tables’获得）。注意，不能盲目地把table_cache设置成很大的值。如果设置得太高，可能会造成文件描述符不足，从而造成性能不稳定或者连接失败。
1G内存机器，推荐值是128－256。内存在4GB左右的服务器该参数可设置为256M或384M。

</pre>
</div>
</div>
<div id="outline-container-orgb30efd3" class="outline-4">
<h4 id="orgb30efd3">max_heap_table_size</h4>
<div class="outline-text-4" id="text-orgb30efd3">
<pre class="example">
用户可以创建的内存表(memory table)的大小。这个值用来计算内存表的最大行数值。这个变量支持动态改变，即set @max_heap_table_size=#
这个变量和tmp_table_size一起限制了内部内存表的大小。如果某个内部heap（堆积）表大小超过tmp_table_size，MySQL可以根据需要自动将内存中的heap表改为基于硬盘的MyISAM表。

</pre>
</div>
</div>
<div id="outline-container-orgf73a7b9" class="outline-4">
<h4 id="orgf73a7b9">tmp_table_size</h4>
<div class="outline-text-4" id="text-orgf73a7b9">
<pre class="example">
通过设置tmp_table_size选项来增加一张临时表的大小，例如做高级GROUP BY操作生成的临时表。如果调高该值，MySQL同时将增加heap表的大小，可达到提高联接查询速度的效果，建议尽量优化查询，要确保查询过程中生成的临时表在内存中，避免临时表过大导致生成基于硬盘的MyISAM表。
默认为16M，可调到64-256最佳，线程独占，太大可能内存不够I/O堵塞。

</pre>
</div>
</div>
<div id="outline-container-org3e4972a" class="outline-4">
<h4 id="org3e4972a">thread_cache_size</h4>
<div class="outline-text-4" id="text-org3e4972a">
<pre class="example">
可以复用的保存在中的线程的数量。如果有，新的线程从缓存中取得，当断开连接的时候如果有空间，客户的线置在缓存中。如果有很多新的线程，为了提高性能可以这个变量值。
通过比较 Connections和Threads_created状态的变量，可以看到这个变量的作用。
默认值为110，可调优为80。

</pre>
</div>
</div>
<div id="outline-container-org96b3990" class="outline-4">
<h4 id="org96b3990">thread_concurrency</h4>
<div class="outline-text-4" id="text-org96b3990">
<pre class="example">
推荐设置为服务器 CPU核数的2倍，例如双核的CPU, 那么thread_concurrency的应该为4；2个双核的cpu, thread_concurrency的值应为8。默认为8

</pre>
</div>
</div>
<div id="outline-container-org2f2fa80" class="outline-4">
<h4 id="org2f2fa80">wait_timeout</h4>
<div class="outline-text-4" id="text-org2f2fa80">
<pre class="example">
指定一个请求的最大连接时间，对于4GB左右内存的服务器可以设置为5-10。

</pre>
</div>
</div>
</div>
<div id="outline-container-orgab9b993" class="outline-3">
<h3 id="orgab9b993">配置InnoDB的几个变量</h3>
<div class="outline-text-3" id="text-orgab9b993">
</div>
<div id="outline-container-orga14b688" class="outline-4">
<h4 id="orga14b688">innodb_buffer_pool_size</h4>
<div class="outline-text-4" id="text-orga14b688">
<pre class="example">
对于InnoDB表来说，innodb_buffer_pool_size的作用就相当于key_buffer_size对于MyISAM表的作用一样。InnoDB使用该参数指定大小的内存来缓冲数据和索引。对于单独的MySQL数据库服务器，最大可以把该值设置成物理内存的80%。
根据MySQL手册，对于2G内存的机器，推荐值是1G（50%）。

</pre>
</div>
</div>
<div id="outline-container-org72d1716" class="outline-4">
<h4 id="org72d1716">innodb_flush_log_at_trx_commit</h4>
<div class="outline-text-4" id="text-org72d1716">
<pre class="example">
主要控制了innodb将log buffer中的数据写入日志文件并flush磁盘的时间点，取值分别为0、1、2三个。0，表示当事务提交时，不做日志写入操作，而是每秒钟将log buffer中的数据写入日志文件并flush磁盘一次；1，则在每秒钟或是每次事物的提交都会引起日志文件写入、flush磁盘的操作，确保了事务的ACID；设置为2，每次事务提交引起写入日志文件的动作，但每秒钟完成一次flush磁盘操作。
实际测试发现，该值对插入数据的速度影响非常大，设置为2时插入10000条记录只需要2秒，设置为0时只需要1秒，而设置为1时则需要229秒。因此，MySQL手册也建议尽量将插入操作合并成一个事务，这样可以大幅提高速度。
根据MySQL手册，在允许丢失最近部分事务的危险的前提下，可以把该值设为0或2。

</pre>
</div>
</div>
<div id="outline-container-org89f3b9f" class="outline-4">
<h4 id="org89f3b9f">innodb_log_buffer_size</h4>
<div class="outline-text-4" id="text-org89f3b9f">
<pre class="example">
log缓存大小，一般为1-8M，默认为1M，对于较大的事务，可以增大缓存大小。
可设置为4M或8M。

</pre>
</div>
</div>
<div id="outline-container-orgad3cf4a" class="outline-4">
<h4 id="orgad3cf4a">innodb_additional_mem_pool_size</h4>
<div class="outline-text-4" id="text-orgad3cf4a">
<pre class="example">
该参数指定InnoDB用来存储数据字典和其他内部数据结构的内存池大小。缺省值是1M。通常不用太大，只要够用就行，应该与表结构的复杂度有关系。如果不够用，MySQL会在错误日志中写入一条警告信息。
根据MySQL手册，对于2G内存的机器，推荐值是20M，可适当增加。

</pre>
</div>
</div>
<div id="outline-container-orgc85adc8" class="outline-4">
<h4 id="orgc85adc8">innodb_thread_concurrency=8</h4>
<div class="outline-text-4" id="text-orgc85adc8">
<pre class="example">
推荐设置为 2*(NumCPUs+NumDisks)，默认一般为8

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd01d95d" class="outline-2">
<h2 id="orgd01d95d">参考资料</h2>
<div class="outline-text-2" id="text-orgd01d95d">
<pre class="example">
http://www.cnblogs.com/Bozh/archive/2013/01/22/2871545.html

</pre>
</div>
</div>
